podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/RTC_MK61F15WS.svd.xml
            <register>
               <name>LR</name>
               <description>Lock Register</description>
               <addressOffset>0x18</addressOffset>
               <resetValue>0xFF</resetValue>
               <fields>
                  <field>
                     <name>TCL</name>
                     <description>Time Compensation Lock\n
Write protects the Time Compensation Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Protected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Unprotected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TCL" > <name>CRL</name> <description>Control Register Lock\n
Write protects the Control Register</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TCL" > <name>SRL</name> <description>Status Register Lock\n
Write protects the Status Register</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TCL" > <name>LRL</name> <description>Lock Register Lock\n
Write protects the Lock Register</description> <bitOffset>6</bitOffset> </field>
                  <field>
                     <name>TTSL</name>
                     <description>Tamper Time Seconds Lock</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper Time Seconds Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper Time Seconds Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MEL</name>
                     <description>Monotonic Enable Lock</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Monotonic Enable Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Monotonic Enable Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCLL</name>
                     <description>Monotonic Counter Low Lock</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Monotonic Counter Low Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Monotonic Counter Low Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MCHL</name>
                     <description>Monotonic Counter High Lock</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Monotonic Counter High Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Monotonic Counter High Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEL</name>
                     <description>Tamper Enable Lock</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper Enable Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper Enable Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TDL</name>
                     <description>Tamper Detect Lock</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper Detect Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper Detect Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTL</name>
                     <description>Tamper Trim Lock</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper Trim Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper Trim Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TIL</name>
                     <description>Tamper Interrupt Lock</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper Interrupt Register is locked and writes are ignored</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Tamper Interrupt Register is not locked and writes complete as normal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x1C</addressOffset>
               <resetValue>0x7</resetValue>
               <fields>
                  <field>
                     <name>TIIE</name>
                     <description>Time Invalid Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TIIE" > <name>TOIE</name> <description>Time Overflow Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TIIE" > <name>TAIE</name> <description>Time Alarm Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TIIE" > <name>MOIE</name> <description>Monotonic Overflow Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TIIE" > <name>TSIE</name> <description>Time Seconds Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>TTSR</name>
               <description>Tamper Time Seconds Register</description>
               <addressOffset>0x20</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>TTS</name>
                     <description>Tamper Time Seconds</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MER</name>
               <description>Monotonic Enable Register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>MCE</name>
                     <description>Monotonic Counter Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Writes to the monotonic counter load the counter with the value written</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Writes to the monotonic counter increment the counter</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCLR</name>
               <description>Monotonic Counter Low Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>MCL</name>
                     <description>Monotonic Counter Low</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>MCHR</name>
               <description>Monotonic Counter High Register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>MCH</name>
                     <description>Monotonic Counter High</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TER</name>
               <description>Tamper Enable Register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>DTE</name>
                     <description>DryIce Tamper Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the DryIce tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VTE</name>
                     <description>Voltage Tamper Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the voltage tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTE</name>
                     <description>Clock Tamper Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the clock tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TTE</name>
                     <description>Temperature Tamper Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the temperature tamper flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSE</name>
                     <description>Flash Security Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the flash security flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TME</name>
                     <description>Test Mode Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Tamper source disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set the time invalid flag if the test mode flag is set</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
